In [1]:
import numpy as np
a=np.array([1,"h",8.9])
a

array(['1', 'h', '8.9'], dtype='<U32')

In [3]:
import pandas as pd
df=pd.read_csv("../data.csv")
df

   id     name  age         city
0   1    Alice   25     New York
1   2      Bob   30  Los Angeles
2   3  Charlie   22      Chicago
3   4    Diana   28      Houston

In [9]:
import requests
response =requests.get("https://www.kaggle.com/datasets/yasserh/titanic-dataset")
file_name="titanic.csv"
if response.status_code==200:
    with open(file_name,'wb') as f:
        f.write(response._content)
        print("file created")

file created

In [19]:
n=pd.Series([1,2,3],index=['a','b','c'])
print(n['a'])

1

In [20]:
print(n[2])

3

C:\Users\91767\AppData\Local\Temp\ipykernel_8932\870272713.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(n[2])

In [21]:
print(n.iloc[2])
print(n.loc['b'])

3
2

In [23]:
d={'a':89,'b':78,'c':90,'d':100}

s=pd.Series(d)
print(s[s>80])

a     89
c     90
d    100
dtype: int64

In [ ]:
s.describe() # statistical summary

count      4.000000
mean      89.250000
std        8.995369
min       78.000000
25%       86.250000
50%       89.500000
75%       92.500000
max      100.000000
dtype: float64

In [29]:
val=pd.Series([1,2,3,4,2,4,1,4,5,7,89])
vc=val.value_counts().sort_index()
print(vc)

1     2
2     2
3     1
4     3
5     1
7     1
89    1
Name: count, dtype: int64

In [ ]:
print(val.sum())

np.int64(122)

In [31]:
import pandas as pd
df=pd.read_csv("../data.csv")
df

   id     name  age         city
0   1    Alice   25     New York
1   2      Bob   30  Los Angeles
2   3  Charlie   22      Chicago
3   4    Diana   28      Houston